#서버 시작후

1. 아이템, 리더기 위치 정보를 입력

2. 실물 팔레트를 생성(아이템, epc)

3. 로트를 생성
    - 로트 생성시 팔레트를 생성( 생성시에는 원자재, (중간재, 완제품)에 따라 다른 상태와 값을 가짐)
            - 원자재: status = 'stock', quantity = x > 0
            - 중간재: status = 'wait', quantity = 0
            - 완제품: status = 'wait', quantity = 0
        

# 공정 시작

## 리더기
1. 리더기 태깅 준비
    - 리더기에서는 시작시 reader-location을 확인하여 공정, 위치를 확인
    - 해당 정보를 통해 lot 선택 가능

    - 선택되어진 lot의 상태를 확인하여 작업 가능 여부 확인

2. 리더기 태깅
    - 태깅 되어진 정보를 토대로 실물팔레트(epc)와 팔레트를 연결
    - 태깅된 정보(epc)를 서버로 전달

## 서버
1. 태깅된 정보를 받음
2. 태깅된 정보(epc)를 통해 전달된 리더기의 공정에 맞는 팔레트의 상태를 확인
3. 상태에 따라 상태 전이를 결정
4. 상태 전이를 결정한 후 팔레트의 상태를 변경
5. 팔레트의 상태를 변경한 후 리더기로 상태 전이 결과를 전달

- 이때 공정에서는 팔레트의 상태를 확인하여 작업 가능 여부 확인


